{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Run fullchain tests\n",
    "\n",
    "See: finnet-pipeline/docker-tests/fullchain/run_tests.py"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "To add packages, append to `dags/requirements_py3.txt` and run `!pip3 install -r /usr/local/dags/requirements_py3.txt`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "# !pip3 install -r /usr/local/dags/requirements_py3.txt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Init Spark"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import findspark\n",
    "findspark.init(\"/usr/local/spark\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from pyspark import SparkContext\n",
    "\n",
    "### Stop current SC, test assumes no existing SC\n",
    "sc = SparkContext.getOrCreate()\n",
    "sc.stop()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Imports and Env"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "os.environ[\"GRAPH_DB\"] = \"\"\"bolt://neo4j:test@neo4j:7687\"\"\"\n",
    "os.environ[\"NEO4J_SSH_PORT\"] = \"22\"\n",
    "os.environ[\"NEO4J_SSH_USERNAME\"] = \"root\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "os.environ['PIPELINE_DATA_PATH'] = \"/datasets/finnet\"\n",
    "os.environ['PIPELINE_DATA_FORMAT'] = \"parquet\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "scrolled": false
   },
   "outputs": [],
   "source": [
    "import sys\n",
    "sys.path.insert(0, \"/usr/local/dags\")\n",
    "\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "from pyspark import SparkConf\n",
    "\n",
    "import json\n",
    "import logging\n",
    "import re\n",
    "\n",
    "from fncore_py3.utils.graph_specification import GraphSpec\n",
    "from fncore_py3.utils.neo4j_conf import get_neo4j_context\n",
    "from fncore_py3.utils.spark_tools import SparkConfFactory, get_spark_context\n",
    "\n",
    "LOCAL_DATA_PATH = os.path.join(os.getcwd(), 'data')\n",
    "DATA_PATH = os.environ['PIPELINE_DATA_PATH']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Run tests"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Set the list of tasks to test\n",
    "dolist = [\n",
    "    'build_lists', 'resolve_entities',\n",
    "    'neo4j_purger', 'neo4j_writer',\n",
    "    'graph_tools'\n",
    "]\n",
    "\n",
    "# Get neo4j ssh username and port\n",
    "neo4j_ssh_username = os.environ.get('NEO4J_SSH_USERNAME', 'neo4j')\n",
    "neo4j_ssh_port = int(os.environ.get('NEO4J_SSH_PORT', 9000))\n",
    "\n",
    "# Setup the spark configuration\n",
    "config = dict()\n",
    "config['SparkConfiguration'] = (SparkConf()\n",
    "                                .setMaster('local[*]')\n",
    "                                .setAppName(\"test create data\")\n",
    "                                .set(\"spark.executor.memory\", \"1024m\"))\n",
    "\n",
    "# Get the graph specs\n",
    "datalist = os.listdir(LOCAL_DATA_PATH)\n",
    "jsonlist = [k for k in datalist if re.match(r'.*\\.json$', k)]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Only 1 json\n",
    "gspec = jsonlist[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Load Graph Spec"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Load the graph spec\n",
    "with open(os.path.join(LOCAL_DATA_PATH, gspec), 'r') as f:\n",
    "    graph_spec = GraphSpec.from_dict(json.load(f))\n",
    "    spec = graph_spec.to_dict()\n",
    "\n",
    "# tables_path = os.path.join(DATA_PATH, graph_spec.name, 'tables')\n",
    "# n_path = os.path.join(DATA_PATH, graph_spec.name, 'node_list')\n",
    "# e_path = os.path.join(DATA_PATH, graph_spec.name, 'edge_list')\n",
    "# n_path_res = os.path.join(DATA_PATH, graph_spec.name, 'node_list_resolved')\n",
    "# e_path_res = os.path.join(DATA_PATH, graph_spec.name, 'edge_list_resolved')\n",
    "\n",
    "logging.info(\"Processing \" + gspec)\n",
    "\n",
    "# Use graph specification's neo4j connection\n",
    "neo_config = {\n",
    "    'uri': spec['graph_uri'],\n",
    "    'max_retries': config.get('neo4j.max_retries', 5),\n",
    "    'max_batchsize': config.get('neo4j.max_batchsize', 10000)\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "# spec\n",
    "\n",
    "# \"\"\"\n",
    "# Note:\n",
    "# test_data_chocolate_node_list: index_column: hidden: True is ignored as intended\n",
    "# \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Entity resolution:\n",
    "\n",
    "How should we disambiguate `S1234567G:Person` and `S1234567G:SoleProprietor`. Need to generate canonical ID? Should be done before hive ingestion then... not part as graph building...? Let them be separate nodes but with 0 distance"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Purge existing Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Purging the graph\n",
    "if 'neo4j_purger' in dolist:\n",
    "    with get_neo4j_context(neo_config['uri']) as neo_context:\n",
    "        neo_context.run(\"\"\"MATCH (n) DETACH DELETE n\"\"\")\n",
    "        \n",
    "        cursor_constraints = neo_context.run(\"CALL db.constraints\")\n",
    "        for constraint_stmt in [k['description'] for k in cursor_constraints.data()]:\n",
    "            neo_context.run(\"DROP {}\".format(constraint_stmt))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'count': 0}]\n"
     ]
    }
   ],
   "source": [
    "# Check nodes in graph\n",
    "with get_neo4j_context(neo_config['uri']) as neo_context:\n",
    "    cursor = neo_context.run(\"MATCH (n) RETURN count(n) as count\")\n",
    "    print(cursor.data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Write nodes and edges to graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "spark_config = SparkConfFactory() \\\n",
    "    .set_master('local[*]') \\\n",
    "    .set_app_name('write neo4j nodes') \\\n",
    "    .set(\"spark.driver.maxResultSize\", \"1g\") \\\n",
    "    .set('spark.executor.memory', '1g') \\"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Pushing nodes...\n",
      "Pushing...\n",
      "Pushing edges1...\n",
      "Pushing...\n",
      "Pushing edges2...\n",
      "Pushing...\n",
      "Pushing edges3...\n",
      "Pushing...\n",
      "Pushing edges4...\n",
      "Pushing...\n"
     ]
    }
   ],
   "source": [
    "from fncore_py3.tasks.spark2neo4j_writer import graph_to_neo4j_cql\n",
    "\n",
    "graph_to_neo4j_cql(graph_spec,\n",
    "                   spark_config,\n",
    "                   data_format='parquet',\n",
    "                   array_delimiter=';',\n",
    "                   debug_write=True\n",
    "                   )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Set up constraints and index nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "from fncore_py3.utils.neo4j_tools import create_index, create_uniqueness_constraint\n",
    "\n",
    "### Still missing some labels but whatever....\n",
    "global_labels = {label for node_kind in graph_spec.node_lists\n",
    "                 for label in node_kind.labels}\n",
    "global_labels.add('_searchable')\n",
    "\n",
    "with get_neo4j_context(neo_config['uri']) as neo_context:\n",
    "    for label in global_labels:\n",
    "        create_uniqueness_constraint(neo_context, label, '_canonical_id')\n",
    "        # No need to create index after constraint created?\n",
    "        # create_index(neo_context, label, '_canonical_id')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Checks"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "### Connect with py2neo\n",
    "from py2neo import Graph\n",
    "graph = Graph(\"bolt://neo4j:test@neo4j:7687\", user=\"neo4j\", password=\"test\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'count': 45}]\n"
     ]
    }
   ],
   "source": [
    "# Check nodes in graph\n",
    "with get_neo4j_context(neo_config['uri']) as neo_context:\n",
    "    cursor = neo_context.run(\"MATCH (n) RETURN count(n) as count\")\n",
    "    print(cursor.data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "frozenset({'_searchable', 'sweets', '8', 'is_target', 'toffee', 'chocolate', 'toffee_groups'})\n",
      "dict_items([('_canonical_id', '1'), ('edge_metadata', 'foo'), ('sweetness number', '1')])\n"
     ]
    }
   ],
   "source": [
    "# Check node 1 in graph\n",
    "with get_neo4j_context(neo_config['uri']) as neo_context:\n",
    "    cursor = neo_context.run(\n",
    "        \"\"\"MATCH (n {_canonical_id: \"1\"}) RETURN n\"\"\"\n",
    "    )\n",
    "    \n",
    "    node = cursor.data()[0]['n']\n",
    "    print(node.labels)\n",
    "    assert(\n",
    "        node.labels \n",
    "        == {'chocolate', 'toffee', 'sweets', 'is_target', '8', '_searchable', 'toffee_groups'}\n",
    "    )\n",
    "    \n",
    "    print(node.items())\n",
    "    assert(\n",
    "        set(node.items()) \n",
    "        == {('_canonical_id', '1'), ('edge_metadata', 'foo'), ('sweetness number', '1')}\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'count': 131}]\n"
     ]
    }
   ],
   "source": [
    "# Check edges in graph\n",
    "with get_neo4j_context(neo_config['uri']) as neo_context:\n",
    "    cursor = neo_context.run(\"MATCH ()-[r]->() RETURN count(r) as count\")\n",
    "    print(cursor.data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "44\n",
      "232\n"
     ]
    }
   ],
   "source": [
    "# Check edges in graph\n",
    "import pandas as pd\n",
    "\n",
    "with get_neo4j_context(neo_config['uri']) as neo_context:\n",
    "    cursor = neo_context.run(\n",
    "        \"\"\"\n",
    "        MATCH (s)-[r]-(t)\n",
    "        RETURN s._canonical_id as source, t._canonical_id as target\n",
    "        \"\"\")\n",
    "    \n",
    "    edge_table = pd.DataFrame(cursor.data())\n",
    "    print(\n",
    "        len(set(edge_table[\"source\"].tolist() + edge_table[\"target\"].tolist()))\n",
    "    )\n",
    "    print(\n",
    "        len(edge_table.drop_duplicates())\n",
    "    )\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'source': '18', 'target': '3'}, {'source': '7', 'target': '5'}, {'source': '3', 'target': '2'}, {'source': '6', 'target': '9'}, {'source': '19', 'target': '3'}, {'source': '1', 'target': '0'}, {'source': '18', 'target': '28'}, {'source': '6', 'target': '5'}, {'source': '1', 'target': '9'}, {'source': '2', 'target': '1'}, {'source': '14', 'target': '13'}, {'source': '6', 'target': '4'}, {'source': '5', 'target': '7'}, {'source': '3', 'target': '18'}, {'source': '5', 'target': '6'}, {'source': '13', 'target': '14'}, {'source': '9', 'target': '1'}, {'source': '1', 'target': '2'}, {'source': '13', 'target': '29'}, {'source': '28', 'target': '18'}, {'source': '3', 'target': '19'}, {'source': '29', 'target': '13'}, {'source': '13', 'target': '2'}, {'source': '2', 'target': '13'}, {'source': '2', 'target': '3'}, {'source': '4', 'target': '6'}, {'source': '9', 'target': '6'}, {'source': '0', 'target': '1'}]\n"
     ]
    }
   ],
   "source": [
    "# Check multi-edges in graph\n",
    "import pandas as pd\n",
    "\n",
    "with get_neo4j_context(neo_config['uri']) as neo_context:\n",
    "    cursor = neo_context.run(\n",
    "        \"\"\"\n",
    "        MATCH (s)-[r]-(t)\n",
    "        WITH s, t, count(r) as rel_cnt\n",
    "        WHERE rel_cnt > 1\n",
    "        RETURN s._canonical_id as source, t._canonical_id as target\n",
    "        \"\"\")\n",
    "    \n",
    "    print(cursor.data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'r': <Relationship id=2228 nodes=(<Node id=1224 labels=set() properties={}>, <Node id=1217 labels=set() properties={}>) type='sweets' properties={}>}, {'r': <Relationship id=2252 nodes=(<Node id=1217 labels=set() properties={}>, <Node id=1224 labels=set() properties={}>) type='sweets' properties={}>}]\n"
     ]
    }
   ],
   "source": [
    "# Check multi-edges in graph\n",
    "with get_neo4j_context(neo_config['uri']) as neo_context:\n",
    "    cursor = neo_context.run(\n",
    "        \"\"\"\n",
    "        MATCH (s)-[r]-(t)\n",
    "        WHERE s._canonical_id='9' AND t._canonical_id='6'\n",
    "        RETURN r\n",
    "        \"\"\")\n",
    "    d = cursor.data()\n",
    "    print(d)\n",
    "    \n",
    "    assert len(d) == 2\n",
    "    \n",
    "    # there exists a 6->9 edge and 9<-6 edge"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'r': <Relationship id=2259 nodes=(<Node id=1227 labels=set() properties={}>, <Node id=1048 labels=set() properties={}>) type='toffee_extended' properties={'edge_prop_2': 'prop2'}>}, {'r': <Relationship id=2253 nodes=(<Node id=1048 labels=set() properties={}>, <Node id=1227 labels=set() properties={}>) type='toffee' properties={'edge_prop_friendly': 'ep2'}>}, {'r': <Relationship id=2208 nodes=(<Node id=1048 labels=set() properties={}>, <Node id=1227 labels=set() properties={}>) type='edge_group_type' properties={}>}]\n"
     ]
    }
   ],
   "source": [
    "# Check edges with extra information\n",
    "with get_neo4j_context(neo_config['uri']) as neo_context:\n",
    "    cursor = neo_context.run(\n",
    "        \"\"\"\n",
    "        MATCH (s)-[r]-(t)\n",
    "        WHERE s._canonical_id='1' AND t._canonical_id='0'\n",
    "        RETURN r\n",
    "        \"\"\")\n",
    "    d = cursor.data()\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'count(r)': 9}]\n"
     ]
    }
   ],
   "source": [
    "# Check node group edges\n",
    "with get_neo4j_context(neo_config['uri']) as neo_context:\n",
    "    cursor = neo_context.run(\n",
    "        \"\"\"\n",
    "        MATCH ()-[r :edge_group_type]->()\n",
    "        RETURN count(r)\n",
    "        \"\"\")\n",
    "    d = cursor.data()\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'r': <Relationship id=2263 nodes=(<Node id=1043 labels=set() properties={}>, <Node id=1224 labels=set() properties={}>) type='toffee' properties={'edge_prop_friendly': 'ep2', 'reverse_order': 'reverse'}>}]\n"
     ]
    }
   ],
   "source": [
    "# Check multi-edges in graph\n",
    "with get_neo4j_context(neo_config['uri']) as neo_context:\n",
    "    cursor = neo_context.run(\n",
    "        \"\"\"\n",
    "        MATCH (s)-[r]->(t)\n",
    "        WHERE s._canonical_id='8' AND t._canonical_id='9'\n",
    "        RETURN r\n",
    "        \"\"\")\n",
    "    d = cursor.data()\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Viz"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "# ### Connect with py2neo\n",
    "# from py2neo import Graph\n",
    "# graph = Graph(\"bolt://neo4j:test@neo4j:7687\", user=\"neo4j\", password=\"test\")\n",
    "\n",
    "# ### Plot with neo4jupyter\n",
    "# import neo4jupyter\n",
    "# neo4jupyter.init_notebook_mode()\n",
    "\n",
    "# neo4jupyter.draw(graph, {\"User\": \"id\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "spark_config = SparkConfFactory() \\\n",
    "    .set_master('local[*]') \\\n",
    "    .set_app_name('write neo4j nodes') \\\n",
    "    .set(\"spark.driver.maxResultSize\", \"1g\") \\\n",
    "    .set('spark.executor.memory', '1g') \\"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+---+---+\n",
      "| _1| _2|\n",
      "+---+---+\n",
      "|  1|  2|\n",
      "|  1|  2|\n",
      "+---+---+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "from fncore_py3.utils.spark_tools import get_spark_context\n",
    "from pyspark import SQLContext\n",
    "from pyspark.sql.functions import array, col\n",
    "\n",
    "with get_spark_context(spark_config.create()) as spark_context:\n",
    "    sql_context = SQLContext(spark_context)\n",
    "    \n",
    "    df = sql_context.createDataFrame([(1,2), (1,2)])\n",
    "    df.filter((col(\"_1\") > 0) & (col(\"_1\") > 0)).show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
